<?php

class Model
{
	
	/*
		Модель обычно включает методы выборки данных, это могут быть:
			> методы нативных библиотек pgsql или mysql;
			> методы библиотек, реализующих абстракицю данных. Например, методы библиотеки PEAR MDB2;
			> методы ORM;
			> методы для работы с NoSQL;
			> и др.
	*/

	// метод выборки данных
        //private $mysqli;
        //function __construct() {
           // $this->mysqli= new Mysqli('HOST', 'LOGIN', 'PASS', 'BD');
          
        public function connectDB()
        {
            $conn = new Mysqli(HOST, LOGIN, PASS, BD);
            $conn->set_charset('utf8');
            return $conn;
            
        }
        
        public function checker()
                {
            if($_SESSION['isauth']==FALSE)
            {
                header('location: /');
                
            }
            
                }
                
                
                
      public function transliterate($rus)	{
			$tr = array(
            "А"=>"a",            "Б"=>"b",
            "В"=>"v",            "Г"=>"g",
            "Д"=>"d",            "Е"=>"e",
            "Ё"=>"e",            "Ж"=>"j",
            "З"=>"z",            "И"=>"i",
            "Й"=>"y",            "К"=>"k",
            "Л"=>"l",            "М"=>"m",
            "Н"=>"n",            "О"=>"o",
            "П"=>"p",            "Р"=>"r",
            "С"=>"s",            "Т"=>"t",
            "У"=>"u",            "Ф"=>"f",
            "Х"=>"h",            "Ц"=>"ts",
            "Ч"=>"ch",           "Ш"=>"sh",
            "Щ"=>"sch",          "Ъ"=>"",
            "Ы"=>"i",            "Ь"=>"j",
            "Э"=>"e",            "Ю"=>"yu",
            "Я"=>"ya",           "а"=>"a",
            "б"=>"b",            "в"=>"v",
            "г"=>"g",            "д"=>"d",
            "е"=>"e",            "ё"=>"e",
            "ж"=>"j",            "з"=>"z",
            "и"=>"i",            "й"=>"y",
            "к"=>"k",            "л"=>"l",
            "м"=>"m",            "н"=>"n",
            "о"=>"o",            "п"=>"p",
            "р"=>"r",            "с"=>"s",
            "т"=>"t",            "у"=>"u",
            "ф"=>"f",            "х"=>"h",
            "ц"=>"ts",           "ч"=>"ch",
            "ш"=>"sh",           "щ"=>"sch",
            "ъ"=>"y",            "ы"=>"i",
            "ь"=>"j",            "э"=>"e",
            "ю"=>"yu",           "я"=>"ya",
            " "=> "_",           "."=> "",
            "/"=> "_",           ","=>"_",
            "-"=>"_",            "("=>"",
            ")"=>"",             "["=>"",
            "]"=>"",             "="=>"_",
            "+"=>"_",            "*"=>"",
            "?"=>"",             "\""=>"",
            "'"=>"",             "&"=>"",
            "%"=>"",             "#"=>"",
            "@"=>"",             "!"=>"",
            ";"=>"",             "№"=>"",
            "^"=>"",             ":"=>"",
            "~"=>"",             "\\"=>""
        );
	return strtr($rus, $tr);
			
		}
}
        
            
            
        

        
